betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_ltdc.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : ch32h417_ltdc.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file provides all the LTDC firmware functions.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32h417_ltdc.h"
#include "ch32h417_rcc.h"

#define GCR_MASK ((uint32_t)0x0FFE888F)

/*********************************************************************
 * @fn      LTDC_DeInit
 *
 * @brief   Deinitializes the LTDC peripheral registers to their default reset
 *        values.
 * 
 * @param   none
 * 
 * @return  none
 */
void LTDC_DeInit(void)
{
    RCC_HB2PeriphResetCmd(RCC_HB2Periph_LTDC, ENABLE);

    RCC_HB2PeriphResetCmd(RCC_HB2Periph_LTDC, DISABLE);
}

/*********************************************************************
 * @fn      LTDC_Init
 *
 * @brief   Initializes the LTDC peripheral according to the specified parameters
 *        in the LTDC_InitStruct.
 * 
 * @param   LTDC_InitStruct - pointer to a LTDC_InitTypeDef structure that contains
 *        the configuration information for the specified LTDC peripheral.
 * 
 * @return  none
 */
void LTDC_Init(LTDC_InitTypeDef* LTDC_InitStruct)
{
    uint32_t horizontalsync = 0;
    uint32_t accumulatedHBP = 0;
    uint32_t accumulatedactiveW = 0;
    uint32_t totalwidth = 0;
    uint32_t backgreen = 0;
    uint32_t backred = 0;

    LTDC->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
    horizontalsync = (LTDC_InitStruct->LTDC_HorizontalSync << 16);
    LTDC->SSCR |= (horizontalsync | LTDC_InitStruct->LTDC_VerticalSync);

    LTDC->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
    accumulatedHBP = (LTDC_InitStruct->LTDC_AccumulatedHBP << 16);
    LTDC->BPCR |= (accumulatedHBP | LTDC_InitStruct->LTDC_AccumulatedVBP);

    LTDC->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
    accumulatedactiveW = (LTDC_InitStruct->LTDC_AccumulatedActiveW << 16);
    LTDC->AWCR |= (accumulatedactiveW | LTDC_InitStruct->LTDC_AccumulatedActiveH);

    LTDC->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
    totalwidth = (LTDC_InitStruct->LTDC_TotalWidth << 16);
    LTDC->TWCR |= (totalwidth | LTDC_InitStruct->LTDC_TotalHeigh);

    LTDC->GCR &= (uint32_t)GCR_MASK;
    LTDC->GCR |= (uint32_t)(LTDC_InitStruct->LTDC_HSPolarity | LTDC_InitStruct->LTDC_VSPolarity |
                            LTDC_InitStruct->LTDC_DEPolarity | LTDC_InitStruct->LTDC_PCPolarity);

    backgreen = (LTDC_InitStruct->LTDC_BackgroundGreenValue << 8);
    backred = (LTDC_InitStruct->LTDC_BackgroundRedValue << 16);

    LTDC->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
    LTDC->BCCR |= (backred | backgreen | LTDC_InitStruct->LTDC_BackgroundBlueValue);
}

/*********************************************************************
 * @fn      LTDC_StructInit
 *
 * @brief   Fills each LTDC_InitStruct member with its default value.
 * 
 * @param   LTDC_InitStruct - pointer to a LTDC_InitTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_StructInit(LTDC_InitTypeDef* LTDC_InitStruct)
{
    LTDC_InitStruct->LTDC_HSPolarity = LTDC_HSPolarity_AL;
    LTDC_InitStruct->LTDC_VSPolarity = LTDC_VSPolarity_AL;
    LTDC_InitStruct->LTDC_DEPolarity = LTDC_DEPolarity_AL;
    LTDC_InitStruct->LTDC_PCPolarity = LTDC_PCPolarity_IPC;
    LTDC_InitStruct->LTDC_HorizontalSync = 0x00;
    LTDC_InitStruct->LTDC_VerticalSync = 0x00;
    LTDC_InitStruct->LTDC_AccumulatedHBP = 0x00;
    LTDC_InitStruct->LTDC_AccumulatedVBP = 0x00;
    LTDC_InitStruct->LTDC_AccumulatedActiveW = 0x00;
    LTDC_InitStruct->LTDC_AccumulatedActiveH = 0x00;
    LTDC_InitStruct->LTDC_TotalWidth = 0x00;
    LTDC_InitStruct->LTDC_TotalHeigh = 0x00;
    LTDC_InitStruct->LTDC_BackgroundRedValue = 0x00;
    LTDC_InitStruct->LTDC_BackgroundGreenValue = 0x00;
    LTDC_InitStruct->LTDC_BackgroundBlueValue = 0x00;
}

/*********************************************************************
 * @fn      LTDC_Cmd
 *
 * @brief   Enables or disables the LTDC Controller.
 * 
 * @param   NewState - ENABLE or DISABLE.
 * 
 * @return  none
 */
void LTDC_Cmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        LTDC->GCR |= (uint32_t)LTDC_GCR_LTDCEN;
    }
    else
    {
        LTDC->GCR &= ~(uint32_t)LTDC_GCR_LTDCEN;
    }
}

/*********************************************************************
 * @fn      LTDC_DitherCmd
 *
 * @brief   Enables or disables Dither.
 * 
 * @param   NewState - ENABLE or DISABLE.
 * 
 * @return  none
 */
void LTDC_DitherCmd(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        LTDC->GCR |= (uint32_t)LTDC_GCR_DEN;
    }
    else
    {
        LTDC->GCR &= ~(uint32_t)LTDC_GCR_DEN;
    }
}

/*********************************************************************
 * @fn      LTDC_GetRGBWidth
 *
 * @brief   Get the dither RGB width.
 * 
 * @param   LTDC_RGB_InitStruct - pointer to a LTDC_RGBTypeDef structure that contains
 *        the Dither RGB width.
 * 
 * @return  none
 */
LTDC_RGBTypeDef LTDC_GetRGBWidth(void)
{
    LTDC_RGBTypeDef LTDC_RGB_InitStruct;

    LTDC->GCR &= (uint32_t)GCR_MASK;

    LTDC_RGB_InitStruct.LTDC_BlueWidth = (uint32_t)((LTDC->GCR >> 4) & 0x7);
    LTDC_RGB_InitStruct.LTDC_GreenWidth = (uint32_t)((LTDC->GCR >> 8) & 0x7);
    LTDC_RGB_InitStruct.LTDC_RedWidth = (uint32_t)((LTDC->GCR >> 12) & 0x7);

    return LTDC_RGB_InitStruct;
}

/*********************************************************************
 * @fn      LTDC_RGBStructInit
 *
 * @brief   Fills each LTDC_RGBStruct member with its default value.
 * 
 * @param   LTDC_RGB_InitStruct - pointer to a LTDC_RGBTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_RGBStructInit(LTDC_RGBTypeDef* LTDC_RGB_InitStruct)
{
    LTDC_RGB_InitStruct->LTDC_BlueWidth = 0x02;
    LTDC_RGB_InitStruct->LTDC_GreenWidth = 0x02;
    LTDC_RGB_InitStruct->LTDC_RedWidth = 0x02;
}

/*********************************************************************
 * @fn      LTDC_LIPConfig
 *
 * @brief   Define the position of the line interrupt .
 * 
 * @param   LTDC_LIPositionConfig - Line Interrupt Position.
 * 
 * @return  none
 */
void LTDC_LIPConfig(uint32_t LTDC_LIPositionConfig)
{
    LTDC->LIPCR = (uint32_t)LTDC_LIPositionConfig;
}

/*********************************************************************
 * @fn      LTDC_ReloadConfig
 *
 * @brief   reload layers registers with new parameters 
 * 
 * @param   LTDC_Reload - specifies the type of reload.
 *        This parameter can be one of the following values:
 *            LTDC_IMReload - Vertical blanking reload.
 *            LTDC_VBReload - Immediate reload.  
 * 
 * @return  none
 */
void LTDC_ReloadConfig(uint32_t LTDC_Reload)
{
    LTDC->SRCR = (uint32_t)LTDC_Reload;
}

/*********************************************************************
 * @fn      LTDC_LayerInit
 *
 * @brief   Initializes the LTDC Layer according to the specified parameters
 *        in the LTDC_LayerStruct.
 * 
 * @param   LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2    
 *          LTDC_LayerStruct - pointer to a LTDC_LayerTypeDef structure that contains
 *        the configuration information for the specified LTDC peripheral.
 * 
 * @return  none
 */
void LTDC_LayerInit(LTDC_Layer_TypeDef* LTDC_Layerx, LTDC_Layer_InitTypeDef* LTDC_Layer_InitStruct)
{
    uint32_t whsppos = 0;
    uint32_t wvsppos = 0;
    uint32_t dcgreen = 0;
    uint32_t dcred = 0;
    uint32_t dcalpha = 0;
    uint32_t cfbp = 0;

    whsppos = LTDC_Layer_InitStruct->LTDC_HorizontalStop << 16;
    LTDC_Layerx->WHPCR &= ~(LTDC_WHPCR_WHSTPOS | LTDC_WHPCR_WHSPPOS);
    LTDC_Layerx->WHPCR = (LTDC_Layer_InitStruct->LTDC_HorizontalStart | whsppos);

    wvsppos = LTDC_Layer_InitStruct->LTDC_VerticalStop << 16;
    LTDC_Layerx->WVPCR &= ~(LTDC_WVPCR_WVSTPOS | LTDC_WVPCR_WVSPPOS);
    LTDC_Layerx->WVPCR = (LTDC_Layer_InitStruct->LTDC_VerticalStart | wvsppos);

    LTDC_Layerx->PFCR &= ~(LTDC_PFCR_PF);
    LTDC_Layerx->PFCR = (LTDC_Layer_InitStruct->LTDC_PixelFormat);

    dcgreen = (LTDC_Layer_InitStruct->LTDC_DefaultColorGreen << 8);
    dcred = (LTDC_Layer_InitStruct->LTDC_DefaultColorRed << 16);
    dcalpha = (LTDC_Layer_InitStruct->LTDC_DefaultColorAlpha << 24);
    LTDC_Layerx->DCCR &= ~(LTDC_DCCR_DCBLUE | LTDC_DCCR_DCGREEN | LTDC_DCCR_DCRED | LTDC_DCCR_DCALPHA);
    LTDC_Layerx->DCCR = (LTDC_Layer_InitStruct->LTDC_DefaultColorBlue | dcgreen |
                         dcred | dcalpha);

    LTDC_Layerx->CACR &= ~(LTDC_CACR_CONSTA);
    LTDC_Layerx->CACR = (LTDC_Layer_InitStruct->LTDC_ConstantAlpha);

    LTDC_Layerx->BFCR &= ~(LTDC_BFCR_BF2 | LTDC_BFCR_BF1);
    LTDC_Layerx->BFCR = (LTDC_Layer_InitStruct->LTDC_BlendingFactor_1 | LTDC_Layer_InitStruct->LTDC_BlendingFactor_2);

