betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_ltdc.c
    LTDC->SRCR = LTDC_IMReload;
}

/*********************************************************************
 * @fn      LTDC_CLUTInit
 *
 * @brief   configure the CLUT.
 * 
 * @param   LTDC_CLUT_InitStruct - pointer to a LTDC_CLUT_InitTypeDef structure that contains
 *        the CLUT configuration.
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2   
 * 
 * @return  none
 */
void LTDC_CLUTInit(LTDC_Layer_TypeDef* LTDC_Layerx, LTDC_CLUT_InitTypeDef* LTDC_CLUT_InitStruct)
{
    uint32_t green = 0;
    uint32_t red = 0;
    uint32_t clutadd = 0;

    green = (LTDC_CLUT_InitStruct->LTDC_GreenValue << 8);
    red = (LTDC_CLUT_InitStruct->LTDC_RedValue << 16);
    clutadd = (LTDC_CLUT_InitStruct->LTDC_CLUTAdress << 24);
    LTDC_Layerx->CLUTWR = (clutadd | LTDC_CLUT_InitStruct->LTDC_BlueValue |
                           green | red);
}

/*********************************************************************
 * @fn      LTDC_CLUTStructInit
 *
 * @brief   Fills each LTDC_CLUT_InitStruct member with its default value.
 * 
 * @param   LTDC_CLUT_InitStruct - pointer to a LTDC_CLUT_InitTypeDef structure which will
 *        be initialized.
 * 
 * @return  none
 */
void LTDC_CLUTStructInit(LTDC_CLUT_InitTypeDef* LTDC_CLUT_InitStruct)
{
    LTDC_CLUT_InitStruct->LTDC_CLUTAdress = 0x00;
    LTDC_CLUT_InitStruct->LTDC_BlueValue = 0x00;
    LTDC_CLUT_InitStruct->LTDC_GreenValue = 0x00;
    LTDC_CLUT_InitStruct->LTDC_RedValue = 0x00;
}

/*********************************************************************
 * @fn      LTDC_LayerPosition
 *
 * @brief   reconfigure the layer position.
 * 
 * @param   OffsetX - horizontal offset from start active width .
 *          OffsetY - vertical offset from start active height.   
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2   
 * 
 * @return  Reload of the shadow registers values must be applied after layer 
 *        position reconfiguration.
 */
void LTDC_LayerPosition(LTDC_Layer_TypeDef* LTDC_Layerx, uint16_t OffsetX, uint16_t OffsetY)
{
    uint32_t tempreg, temp;
    uint32_t horizontal_start;
    uint32_t horizontal_stop;
    uint32_t vertical_start;
    uint32_t vertical_stop;

    LTDC_Layerx->WHPCR &= ~(LTDC_WHPCR_WHSTPOS | LTDC_WHPCR_WHSPPOS);
    LTDC_Layerx->WVPCR &= ~(LTDC_WVPCR_WVSTPOS | LTDC_WVPCR_WVSPPOS);

    tempreg = LTDC->BPCR;
    horizontal_start = (tempreg >> 16) + 1 + OffsetX;
    vertical_start = (tempreg & 0xFFFF) + 1 + OffsetY;

    tempreg = LTDC_Layerx->PFCR;

    if (tempreg == LTDC_Pixelformat_ARGB8888)
    {
        temp = 4;
    }
    else if (tempreg == LTDC_Pixelformat_RGB888)
    {
        temp = 3;
    }
    else if (
        (tempreg == LTDC_Pixelformat_RGB565) ||
        (tempreg == LTDC_Pixelformat_ARGB1555) ||
        (tempreg == LTDC_Pixelformat_AL88))
    {
        temp = 2;
    }
    else
    {
        temp = 1;
    }

    tempreg = LTDC_Layerx->CFBLR;
    horizontal_stop = (((tempreg & 0x1FFF) - 3) / temp) + horizontal_start - 1;

    tempreg = LTDC_Layerx->CFBLNR;
    vertical_stop = (tempreg & 0x7FF) + vertical_start - 1;

    LTDC_Layerx->WHPCR = horizontal_start | (horizontal_stop << 16);
    LTDC_Layerx->WVPCR = vertical_start | (vertical_stop << 16);
}

/*********************************************************************
 * @fn      LTDC_LayerAlpha
 *
 * @brief   reconfigure constant alpha.
 * 
 * @param   ConstantAlpha - constant alpha value.
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2    
 * 
 * @return  Reload of the shadow registers values must be applied after constant 
 *        alpha reconfiguration.         
 */
void LTDC_LayerAlpha(LTDC_Layer_TypeDef* LTDC_Layerx, uint8_t ConstantAlpha)
{
    LTDC_Layerx->CACR = ConstantAlpha;
}

/*********************************************************************
 * @fn      LTDC_LayerAddress
 *
 * @brief   reconfigure layer address.
 * 
 * @param   Address - The color frame buffer start address.
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2     
 * 
 * @return  Reload of the shadow registers values must be applied after layer 
 *        address reconfiguration.
 */
void LTDC_LayerAddress(LTDC_Layer_TypeDef* LTDC_Layerx, uint32_t Address)
{
    LTDC_Layerx->CFBAR = Address;
}

/*********************************************************************
 * @fn      LTDC_LayerSize
 *
 * @brief   reconfigure layer size.
 * 
 * @param   Width - layer window width.
 *          Height - layer window height.   
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2   
 * 
 * @return  Reload of the shadow registers values must be applied after layer 
 *        size reconfiguration.
 */
void LTDC_LayerSize(LTDC_Layer_TypeDef* LTDC_Layerx, uint32_t Width, uint32_t Height)
{
    uint8_t  temp;
    uint32_t tempreg;
    uint32_t horizontal_start;
    uint32_t horizontal_stop;
    uint32_t vertical_start;
    uint32_t vertical_stop;

    tempreg = LTDC_Layerx->PFCR;

    if (tempreg == LTDC_Pixelformat_ARGB8888)
    {
        temp = 4;
    }
    else if (tempreg == LTDC_Pixelformat_RGB888)
    {
        temp = 3;
    }
    else if ((tempreg == LTDC_Pixelformat_RGB565) ||
             (tempreg == LTDC_Pixelformat_ARGB1555) ||
             (tempreg == LTDC_Pixelformat_AL88))
    {
        temp = 2;
    }
    else
    {
        temp = 1;
    }

    tempreg = LTDC_Layerx->WHPCR;
    horizontal_start = (tempreg & 0x1FFF);
    horizontal_stop = Width + horizontal_start - 1;

    tempreg = LTDC_Layerx->WVPCR;
    vertical_start = (tempreg & 0x1FFF);
    vertical_stop = Height + vertical_start - 1;

    LTDC_Layerx->WHPCR = horizontal_start | (horizontal_stop << 16);
    LTDC_Layerx->WVPCR = vertical_start | (vertical_stop << 16);

    LTDC_Layerx->CFBLR = ((Width * temp) << 16) | ((Width * temp) + 3);

    LTDC_Layerx->CFBLNR = Height;
}

/*********************************************************************
 * @fn      LTDC_LayerPixelFormat
 *
 * @brief   reconfigure layer pixel format.
 * 
 * @param   PixelFormat - reconfigure the pixel format, this parameter can be 
 *        one of the following values:@ref LTDC_Pixelformat.   
 *          LTDC_layerx - Select the layer to be configured, this parameter can be 
 *        one of the following values: LTDC_Layer1, LTDC_Layer2   
 * 
 * @return  Reload of the shadow registers values must be applied after layer 
 *        pixel format reconfiguration.
 */
void LTDC_LayerPixelFormat(LTDC_Layer_TypeDef* LTDC_Layerx, uint32_t PixelFormat)
{
    uint8_t  temp;
    uint32_t tempreg;

    tempreg = LTDC_Layerx->PFCR;

    if (tempreg == LTDC_Pixelformat_ARGB8888)
    {
        temp = 4;
    }
    else if (tempreg == LTDC_Pixelformat_RGB888)
    {
        temp = 3;
    }
    else if ((tempreg == LTDC_Pixelformat_RGB565) ||
             (tempreg == LTDC_Pixelformat_ARGB1555) ||
             (tempreg == LTDC_Pixelformat_AL88))
    {
        temp = 2;
    }
    else
    {
        temp = 1;
    }

    tempreg = (LTDC_Layerx->CFBLR >> 16);
    tempreg = (tempreg / temp);

    if (PixelFormat == LTDC_Pixelformat_ARGB8888)
    {
        temp = 4;
    }
    else if (PixelFormat == LTDC_Pixelformat_RGB888)
    {
        temp = 3;
    }
    else if ((PixelFormat == LTDC_Pixelformat_RGB565) ||
             (PixelFormat == LTDC_Pixelformat_ARGB1555) ||
             (PixelFormat == LTDC_Pixelformat_AL88))
    {
        temp = 2;
    }
    else
    {
        temp = 1;
    }

