betaflight/betaflight/lib/main/CH32H41x/Peripheral/src/ch32h417_ltdc.c
    LTDC_Layerx->CFBLR = ((tempreg * temp) << 16) | ((tempreg * temp) + 3);

    LTDC_Layerx->PFCR = PixelFormat;
}

/*********************************************************************
 * @fn      LTDC_ITConfig
 *
 * @brief   Enables or disables the specified LTDC's interrupts.
 * 
 * @param   LTDC_IT - specifies the LTDC interrupts sources to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *            LTDC_IT_LI - Line Interrupt Enable.
 *            LTDC_IT_FU - FIFO Underrun Interrupt Enable.
 *            LTDC_IT_TERR - Transfer Error Interrupt Enable.
 *            LTDC_IT_RR - Register Reload interrupt enable.  
 *          NewState - ENABLE or DISABLE.
 * 
 * @return  none
 */
void LTDC_ITConfig(uint32_t LTDC_IT, FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        LTDC->IER |= LTDC_IT;
    }
    else
    {
        LTDC->IER &= (uint32_t)~LTDC_IT;
    }
}

/*********************************************************************
 * @fn      LTDC_GetFlagStatus
 *
 * @brief   Checks whether the specified LTDC's flag is set or not.
 * 
 * @param   LTDC_FLAG - specifies the flag to check.
 *        This parameter can be one of the following values:
 *            LTDC_FLAG_LI -    Line Interrupt flag.
 *            LTDC_FLAG_FU -   FIFO Underrun Interrupt flag.
 *            LTDC_FLAG_TERR - Transfer Error Interrupt flag.
 *            LTDC_FLAG_RR -   Register Reload interrupt flag.
 * 
 * @return  The new state of LTDC_FLAG (SET or RESET).
 */
FlagStatus LTDC_GetFlagStatus(uint32_t LTDC_FLAG)
{
    FlagStatus bitstatus = RESET;

    if ((LTDC->ISR & LTDC_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      LTDC_ClearFlag
 *
 * @brief   Clears the LTDC's pending flags.
 * 
 * @param   LTDC_FLAG - specifies the flag to clear.
 *        This parameter can be any combination of the following values:
 *            LTDC_FLAG_LI -    Line Interrupt flag.
 *            LTDC_FLAG_FU -   FIFO Underrun Interrupt flag.
 *            LTDC_FLAG_TERR - Transfer Error Interrupt flag.
 *            LTDC_FLAG_RR -   Register Reload interrupt flag.  
 * 
 * @return  none
 */
void LTDC_ClearFlag(uint32_t LTDC_FLAG)
{
    LTDC->ICR = (uint32_t)LTDC_FLAG;
}

/*********************************************************************
 * @fn      LTDC_GetITStatus
 *
 * @brief   Checks whether the specified LTDC's interrupt has occurred or not.
 * 
 * @param   LTDC_IT - specifies the LTDC interrupts sources to check.
 *        This parameter can be one of the following values:
 *            LTDC_IT_LI -    Line Interrupt Enable.
 *            LTDC_IT_FU -   FIFO Underrun Interrupt Enable.
 *            LTDC_IT_TERR - Transfer Error Interrupt Enable.
 *            LTDC_IT_RR -   Register Reload interrupt Enable.
 * 
 * @return  The new state of the LTDC_IT (SET or RESET).
 */
ITStatus LTDC_GetITStatus(uint32_t LTDC_IT)
{
    ITStatus bitstatus = RESET;

    if ((LTDC->ISR & LTDC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    if (((LTDC->IER & LTDC_IT) != (uint32_t)RESET) && (bitstatus != (uint32_t)RESET))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      LTDC_ClearITPendingBit
 *
 * @brief   Clears the LTDC's interrupt pending bits.
 * 
 * @param   LTDC_IT - specifies the interrupt pending bit to clear.
 *        This parameter can be any combination of the following values:
 *            LTDC_IT_LIE -    Line Interrupt.
 *            LTDC_IT_FUIE -   FIFO Underrun Interrupt.
 *            LTDC_IT_TERRIE - Transfer Error Interrupt.
 *            LTDC_IT_RRIE -   Register Reload interrupt.
 * 
 * @return  none
 */
void LTDC_ClearITPendingBit(uint32_t LTDC_IT)
{
    LTDC->ICR = (uint32_t)LTDC_IT;
}